/****************************************Copyright (c)**************************************************
**                                杭州鑫高科技有限公司
**                                     
**                                
** 文   件   名: bsp_QEI.h
** 最后修改日期: 2016/7/27 13:04:40
** 描        述: 
** 版	     本: V1.0
** 主  控  芯 片:  晶振频率: 
** IDE: 
**********************************************************************************************************/
#ifndef __QEI_H
#define	__QEI_H
 
  
void bsp_InitQEI(void);				//初始化正交编码器
int32_t bsp_GetQEI(uint8_t Ch);		//读取正交编码器值
void bsp_QEI_Task(void);			//周期性的执行此函数	 

#endif




	

	

	












