/**************************************************************************************************************
*@File:       bsp_dog.h
*@IDE :       MDK5.10.0.0+STM32F103ZET6
*@Function:   实现看门狗相关驱动
*@Author:     Wy
*@Date:       180412
*@Version:    V1.0.0
*@brief:      None
*运用举例:
注意：1、对于窗口看门狗和独立看门狗 ，需要根据看门狗的时间设置相应的预分频值
	  2、原则上窗口看门狗的精度比独立看门狗高 但看门狗的定时周期相对较短
int main(void)
{
	bsp_dogInit();
	while (1)
	{
		bsp_iwdogFeed();
		bsp_wwdogFeed();//喂狗
	}
}
***************************************************************************************************************/

#ifndef _BSP_DOG_H
#define _BSP_DOG_H


/**************************************************************************************************************
                           Public Define
***************************************************************************************************************/
/*相关配置*/
#define  WWDOG_IT_ENABLE         1 //窗口定时器支持中断

#define  WWDOG_ENABLE            1 //窗口看门狗使能
#define  IWDOG_ENABLE            0 //独立看门狗使能


#define  WWDOG_PRIEOD           7000 //单位1 us
#define  IWDOG_PRIEOD           10 //单位0.1 ms 看门狗周期=IWDOG_PRIEOD*0.1ms(max:4095)


/**************************************************************************************************************
                            Export Function
***************************************************************************************************************/
void bsp_dogInit(void);
#if IWDOG_ENABLE
void bsp_iwdogFeed(void);
#endif 
#if WWDOG_ENABLE 
void bsp_wwdogFeed(void);
#endif

#endif //end file


/********************************Copyright (C)2015 - 2025 YM Inc. All Rights Reserved***********************************/






